app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ? WHERE "posts"."id" = ?  [["content", "Here comes posts to see new features."], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

INSERT INTO "posts" ("name", "content") VALUES (?, ?)  [["name", "Update4"], ["content", "You can now wirte comms :D"]]
---
  def create
    post = Post.create(post_params)